# I See Dead People: An Analysis

Bryan Bumgardner, Data Scientist  
February - March 2016

### Death is a fact of life.   
That being said, it's worth studying how it fits in our popular culture. During the Metis Data Science bootcamp (shameless plug), while working on another project I discovered bodycounters.com[http://www.bodycounters.com/]. The dedicated volunteers at this site count and categorize the number of deaths in movies, and to date, have counted for over 2,000 movies. Go grab some beers, count the dead people in your favorite movie, and contribute to the site. 

The data are sitting on their site for anyone to see, and it gave me an idea. I reached out to the site and had some correspondence with Dana, who was gracious enough to share a CSV of all the data. I then cross referenced this data with information from another site, thenumbers.com, which shares basic budget and financial information about thousands of movies. I took this data, mashed it together, and asked some questions. 

Thanks again to the volunteers at bodycounters. Y'all are the greatest. Below is a quick data science passion project to analyze and find patterns in this great data you've collected.

### Major questions:
1. Is the amount of on-screen deaths going up in modern movies?
2. Does a movie's death count have an effect on that movie's domestic gross?
3. Does a movie's death count have an effect on that movie's rating? 
4. How does budget factor into a movie's death count?
5. Is there a relationship between the movie's MPAA rating and body count?

### Table of Contents:
1. Reading and combining the data
2. Outputting various data frames
3. Visualizing
4. Conclusions
5. Documentation of the data

In [1]:
import pandas as pd 
import numpy as np
import csv
import os

import codecs
from bs4 import BeautifulSoup

import statsmodels.api as sm
import statsmodels.formula.api as smf

from sklearn.linear_model import LinearRegression 
from patsy import dmatrices


import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns

%matplotlib inline
sns.set(color_codes=True)

### Step 1: read in and combine the data

Deaths data is a csv...

In [2]:
deaths = pd.read_csv("moviesmovies.csv", encoding="latin-1", index_col="movieskey") #might as well make use of their key

In [3]:
deaths["moviename"] = deaths["moviename"].str.rstrip("\t").str.lower() #cleaning some trailing spaces and standardizing for the matching
deaths["deathcomment"] = deaths["deathcomment"].str.rstrip("\t")

In [4]:
deaths.head(6)

,moviename,deathcount,deathcomment
movieskey,,,
1,king kong,71,"26 with Ape. Also 3 dinosaurs, 4 T-Rexes, 35 v..."
2,wrong turn,8,8
3,death to the supermodels,7,7
4,zombie honeymoon,10,10
5,ginger dead man,7,6 and a cookie
6,punisher,58,58

Grabbed a lot of the budget data from the website by saving it as a html, because the site crashes nonstop. Fixing:

In [5]:
budgetwebsite = pd.read_html("allmoviebudgets.html", header=0, encoding="utf-8")

In [6]:
all_budgets = pd.DataFrame(budgetwebsite[0])

How do I link them together? Fuzzy matching won't work: think "Terminator 2" and "Terminator 3." It would work if I had more data from the deaths source. I know how to do this in Excel...

In [7]:
all_budgets.to_csv("all_budgets.csv", encoding='utf-8')

Ok so I'm really lazy and that only matched like maybe a third of the movies. Let's scrape all the movie data - EVER - because we are crazy. And also because I'm not interested in paying for access to their database. 

So what you see below is me scraping all the budgets and domestic box offices for every movie in the alphabetized database. Every letter has a chart with all the movies starting with that letter. I downloaded each webpage from the data source as an HTML webpage then pulled the charts from that, which is less likely to get you banned than hitting up their site with Selenium.

I then mashed the charts together into one GIANT dataframe which will be helpful for record linkage. This needs properly cleaned as well.

In [8]:
path = 'movie_pages/' #where the HTML files are
listing = os.listdir(path) #read the pages from the directory
all_movie_data = pd.DataFrame(columns = ['Release Date', 'Movie', 'Genre', 'ProductionBudget','DomesticBox Officeto Date', 'Trailer'])

for i, infile in enumerate(listing): #iterate through the files
    temp_list = pd.read_html("movie_pages/"+infile, header=0)
    temp_frame = pd.DataFrame(temp_list[0]) #temp_list is a list of dataframes. Take the first (and only) one
    all_movie_data = all_movie_data.append(temp_frame) #append this to the master dataframe

In [9]:
del all_movie_data['Trailer'] #not necessary and screwed up the dropna

In [10]:
all_movie_data = all_movie_data.dropna() #drop unneccessary lines with incomplete data

In [11]:
all_movie_data.head()

,Release Date,Movie,Genre,ProductionBudget,DomesticBox Officeto Date
5,"Mar 7, 2008","10,000 B.C.",Adventure,"$105,000,000","$94,784,201"
7,"Mar 11, 2016",10 Cloverfield Lane,Thriller/Suspense,"$5,000,000","$26,790,517"
8,"Nov 11, 2015",10 Days in a Madhouse,Drama,"$12,000,000","$14,616"
28,"Nov 22, 2000",102 Dalmatians,Comedy,"$85,000,000","$66,941,559"
31,"Aug 18, 2006",10th & Wolf,Drama,"$8,000,000","$54,702"

In [12]:
all_movie_data.to_csv("all_movie_data.csv", encoding='utf-8') #used this to prove that record linkage was needed.
# Looked at the data in Excel.

In [33]:
all_movie_data["Movie"] = all_movie_data["Movie"].str.lower()
all_movie_data["ProductionBudget"] = all_movie_data["ProductionBudget"].str.strip(['$'])

AttributeError: Can only use .str accessor with string values, which use np.object_ dtype in pandas

In [34]:
all_movie_data

,Release Date,Movie,Genre,ProductionBudget,DomesticBox Officeto Date
5,"Mar 7, 2008","10,000 b.c.",Adventure,NaN,"$94,784,201"
7,"Mar 11, 2016",10 cloverfield lane,Thriller/Suspense,NaN,"$26,790,517"
8,"Nov 11, 2015",10 days in a madhouse,Drama,NaN,"$14,616"
28,"Nov 22, 2000",102 dalmatians,Comedy,NaN,"$66,941,559"
31,"Aug 18, 2006",10th & wolf,Drama,NaN,"$54,702"
35,"Aug 12, 2005",11:14,Drama,NaN,$0
47,"Apr 13, 1957",12 angry men,Drama,NaN,$0
55,"Mar 27, 2009",12 rounds,Action,NaN,"$12,234,694"
60,"Nov 5, 2010",127 hours,Drama,NaN,"$18,335,230"
64,"Apr 23, 2004",13 going on 30,Comedy,NaN,"$57,139,723"
65,"Jan 15, 2016",13 hours: the secret soldiers of benghazi,Drama,NaN,"$52,715,640"
74,"Aug 27, 1999",the 13th warrior,Action,NaN,"$32,694,788"
77,"Jun 22, 2007",1408,Horror,NaN,"$71,975,611"
83,"Mar 9, 2001",15 minutes,Thriller/Suspense,NaN,"$24,375,436"
86,"Mar 3, 2006",16 blocks,Action,NaN,"$36,883,539"
89,"Sep 3, 2010",16 to life,Romantic Comedy,NaN,"$11,574"
94,"Apr 17, 2009",17 again,Comedy,NaN,"$64,167,069"
98,"Nov 9, 1972",1776,Musical,NaN,$0
107,"Dec 14, 1979",1941,Comedy,NaN,"$34,175,000"
112,"Mar 1, 2016",1982,Drama,NaN,$0
1,"Jun 28, 2011",2:13,Horror,NaN,$0
8,"Jun 6, 2003",2 fast 2 furious,Action,NaN,"$127,120,058"
9,"Oct 7, 2005",2 for the money,Drama,NaN,"$22,862,049"
10,"Aug 2, 2013",2 guns,Action,NaN,"$75,612,460"
19,"Dec 24, 1916","20,000 leagues under the sea",Adventure,NaN,"$8,000,000"
20,"Dec 23, 1954","20,000 leagues under the sea",Adventure,NaN,"$28,200,000"
23,"Feb 26, 1999",20 dates,Comedy,NaN,"$536,767"
26,"Feb 26, 1999",200 cigarettes,Romantic Comedy,NaN,"$6,851,636"
30,"Apr 2, 1968",2001: a space odyssey,Adventure,NaN,"$56,700,000"
42,"Nov 13, 2009",2012,Action,NaN,"$166,112,167"
...,...,...,...,...,...
141,"Dec 9, 2011",young adult,Comedy,NaN,"$16,311,571"
144,"Jul 31, 2015",the young and prodigious t.s. spivet,Adventure,NaN,"$176,847"
151,"Dec 15, 1974",young frankenstein,Comedy,NaN,"$86,300,000"
155,"Aug 12, 1988",young guns,Western,NaN,"$44,726,644"
159,"Mar 11, 2016",the young messiah,Drama,NaN,"$3,551,328"
164,"Dec 4, 1985",young sherlock holmes,Adventure,NaN,"$18,106,539"
167,"Dec 18, 2009",the young victoria,Drama,NaN,"$11,001,272"
173,"Apr 8, 2011",your highness,Comedy,NaN,"$21,596,445"
176,"Jun 15, 2012",your sister's sister,Drama,NaN,"$1,597,486"
182,"Nov 23, 2005","yours, mine and ours",Comedy,NaN,"$53,359,917"
187,"Jan 8, 2010",youth in revolt,Comedy,NaN,"$15,285,588"
189,"Dec 18, 1998",you've got mail,Drama,NaN,"$115,731,542"
192,"Aug 13, 2004",yu-gi-oh,Adventure,NaN,"$19,762,690"
4,"Aug 18, 2015",z storm,Action,NaN,$0
8,"Oct 31, 2008",zack and miri make a porno,Comedy,NaN,"$31,457,946"
9,"Dec 31, 2012",zambezia,Comedy,NaN,$0
14,"Nov 11, 2005",zathura,Adventure,NaN,"$28,045,540"
26,"Dec 19, 2012",zero dark thirty,Drama,NaN,"$95,720,716"
29,"Jan 30, 1998",zero effect,Comedy,NaN,"$1,980,338"
55,"Aug 28, 2015",zipper,Thriller/Suspense,NaN,$0
58,"Mar 2, 2007",zodiac,Thriller/Suspense,NaN,"$33,080,084"
68,"Oct 8, 2013",zombie hunter,Action,NaN,$0
74,"Oct 2, 2009",zombieland,Comedy,NaN,"$75,590,286"
76,"Jan 29, 2010",zombies of mass destruction,Comedy,NaN,$0
82,"Jul 8, 2011",zookeeper,Romantic Comedy,NaN,"$80,360,866"
84,"Sep 28, 2001",zoolander,Comedy,NaN,"$45,172,250"
85,"Feb 12, 2016",zoolander 2,Comedy,NaN,"$28,636,609"
86,"Aug 11, 2006",zoom,Adventure,NaN,"$11,631,245"
100,"Dec 31, 2013",zulu,Thriller/Suspense,NaN,$0
105,"Apr 6, 2007",zwartboek,Thriller/Suspense,NaN,"$4,398,532"

After that, just drop rows with null or empty values because this data is dirty:

### 5. Documentation of the data:

Budget and financial data of movies: http://www.the-numbers.com/movie/budgets/all